In [3]:
import pandas as pd

In [4]:
data = pd.DataFrame({"Name": ['Aragorn', 'Boromir', 'Frodo','Galadriel'],
                     "Race": ["human", "human", "hobbit", "elf"],
                     "Age": [88,41,51,8382]})

In [6]:
def divide(row):
        result = row['Age']/10
        return result

data['age_valinor'] = data.apply(divide, axis=1)

data

        Name    Race   Age  age_valinor
0    Aragorn   human    88          8.8
1    Boromir   human    41          4.1
2      Frodo  hobbit    51          5.1
3  Galadriel     elf  8382        838.2

In [7]:
divide_2 = lambda x: x/10

In [8]:

divide_2 = lambda x: x/10
divide_2(data['Age'])

0      8.8
1      4.1
2      5.1
3    838.2
Name: Age, dtype: float64

In [9]:
data['age_2'] = divide_2(data['Age'])

data

        Name    Race   Age  age_valinor  age_2
0    Aragorn   human    88          8.8    8.8
1    Boromir   human    41          4.1    4.1
2      Frodo  hobbit    51          5.1    5.1
3  Galadriel     elf  8382        838.2  838.2

In [10]:
data['age_3'] = data['Age'].apply(lambda x: x/10)

data

        Name    Race   Age  age_valinor  age_2  age_3
0    Aragorn   human    88          8.8    8.8    8.8
1    Boromir   human    41          4.1    4.1    4.1
2      Frodo  hobbit    51          5.1    5.1    5.1
3  Galadriel     elf  8382        838.2  838.2  838.2

In [11]:
data['age_label_2'] = data['Age'].apply(
lambda x:  'elven old' if x > 500 else ('middle-aged' if x >=100 else 'young'))

In [12]:
data['age_label'] = data['Age'].apply(
       Lambda x: 'elven old' if x > 500 else ('middle-aged' if x >=100 else 'young'))

data

SyntaxError: invalid syntax. Perhaps you forgot a comma? (3580395756.py, line 2)

In [13]:
# Apply lambda function to categorize ages
data['age_category'] = data['Age'].apply(lambda x: 'elven old' if x > 500 else ('middle-aged' if x >= 100 else 'young'))

# Display the updated dataframe
data

        Name    Race   Age  age_valinor  age_2  age_3 age_label_2 age_category
0    Aragorn   human    88          8.8    8.8    8.8       young        young
1    Boromir   human    41          4.1    4.1    4.1       young        young
2      Frodo  hobbit    51          5.1    5.1    5.1       young        young
3  Galadriel     elf  8382        838.2  838.2  838.2   elven old    elven old